[
    "The first computer programmer was a woman named Ada Lovelace.",
    "The term 'bug' was popularized after a real moth was found causing issues in an early computer.",
    "The first high-level programming language was Fortran, created in the 1950s.",
    "The majority of code on GitHub is written in JavaScript.",
    "'Hello, World!' is the first program most developers learn to write.",
    "Stack Overflow receives over 50 million visitors each month, mostly from developers.",
    "The popular game 'Tetris' was programmed in just 6 weeks.",
    "A programmer named James Gosling created Java in 1995.",
    "The Python language is named after the British comedy group 'Monty Python', not the snake.",
    "Bill Gates wrote his first computer program at age 13, a game of tic-tac-toe.",
    "The first computer virus was created in 1983 and was called 'Elk Cloner'.",
    "The QWERTY keyboard layout was designed to slow down typing speed to avoid mechanical jams.",
    "Linux, an open-source operating system, powers 96.3% of the world’s top 1 million web servers.",
    "The term 'debugging' was coined by Grace Hopper when she removed a moth from a computer.",
    "Approximately 70% of software developers have a bachelor's degree or higher.",
    "HTML was first proposed by Tim Berners-Lee in 1991.",
    "PHP originally stood for 'Personal Home Page'.",
    "Git, the popular version control system, was created by Linus Torvalds in 2005.",
    "Developers often refer to bugs that are extremely difficult to solve as 'Heisenbugs'.",
    "The C programming language was developed at Bell Labs by Dennis Ritchie.",
    "The most used programming language in data science is Python.",
    "There are over 700 different programming languages in existence.",
    "Google's homepage is so sparse because the original founders didn’t know HTML very well.",
    "90% of the world's supercomputers run on Linux.",
    "SQL, a language used for database management, was developed in the 1970s by IBM.",
    "The first 1GB hard disk drive was released in 1980, weighed over 500 pounds, and cost $40,000.",
    "JavaScript was created in just 10 days by Brendan Eich in 1995.",
    "The world's first computer game, 'Spacewar!', was created in 1962 by Steve Russell.",
    "84% of developers are constantly learning new programming languages and tools.",
    "The longest-running computer program is believed to have been in operation for more than 60 years."
]